Revit 2026 API

# PipeFittingAndAccessoryConnectorData Class

---

The input data used by external servers for calculation of the pipe fitting and pipe accessory coefficient.

SystemObject Autodesk.Revit.DB.PlumbingPipeFittingAndAccessoryConnectorData

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PipeFittingAndAccessoryConnectorData : IDisposable
```
```vb
Public Class PipeFittingAndAccessoryConnectorData
	Implements IDisposable
```
```cpp
public ref class PipeFittingAndAccessoryConnectorData : IDisposable
```
```fsharp
type PipeFittingAndAccessoryConnectorData =
    class
        interface IDisposable
    end
```

The PipeFittingAndAccessoryConnectorData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Angle | The angle of the fitting, Units:(rad). |
|  | Diameter | The connector diameter, Units:(ft). |
|  | Flow | The connector flow, Units:(ft³/s) |
|  | FlowDirection | The flow direction of this connector, In or Out. |
|  | Height | The connector height, Units:(ft). |
|  | Index | Return the index of this connector |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LinkIndex | The index of the connector which is linked with this connector |
|  | Profile | The connector profile. |
|  | VelocityPressure | The connector velocity pressure. Units: (kg/(ft·s²)). |
|  | Width | The connector width, Units:(ft). |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the PipeFittingAndAccessoryConnectorData |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCoordination | Gets the coordination of the connector |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

width, height, diameter, flow, velocity pressure and connector index are input data for the calculation,

#### Reference

Autodesk.Revit.DB.Plumbing Namespace